In [2]:
import pandas as pd

In [3]:
s=pd.Series([10,20,30,40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
print(s[0])

10

## Custom Index

In [5]:
s=pd.Series([10,20,30],index=["a","b","c"])
print(s)

a    10
b    20
c    30
dtype: int64

In [6]:
print(s["a"])

10

In [7]:
print(s[0])

10

C:\Users\BISWAJEET KUMAR\AppData\Local\Temp\ipykernel_10028\287792665.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0])

### Series from Dictionary

In [8]:
data={"Math": 90, "Physics": 98,"Chemistry": 88}

In [9]:
marks=pd.Series(data)

In [10]:
print(data)

{'Math': 90, 'Physics': 98, 'Chemistry': 88}

In [11]:
print(marks)

Math         90
Physics      98
Chemistry    88
dtype: int64

## DataFrame in pandas

In [12]:
data={
    "Name": ["Raju","Bheem","Chutki"],
    "Age": [9,24,17],
    "Marks": [65,90,69]
}

In [13]:
print(data)

{'Name': ['Raju', 'Bheem', 'Chutki'], 'Age': [9, 24, 17], 'Marks': [65, 90, 69]}

In [14]:
type(data)

dict

In [15]:
df=pd.DataFrame(data)

In [16]:
print(df) ##Pandas automatically adds a default index: this is called a range Index(Start from 0 by default)

     Name  Age  Marks
0    Raju    9     65
1   Bheem   24     90
2  Chutki   17     69

In [17]:
#we can also add custom index in pandas dataframe
df= pd.DataFrame(
    data,
    index =["Student 1","Student 2","Student 3"]
)

In [18]:
print(df)

             Name  Age  Marks
Student 1    Raju    9     65
Student 2   Bheem   24     90
Student 3  Chutki   17     69

In [19]:
df.set_index("Name",inplace=True) #if we are setting in place = true it means we are changing the original object it self. if we do this without inplace it will create a new dataframe

In [20]:
print(df)

        Age  Marks
Name
Raju      9     65
Bheem    24     90
Chutki   17     69

In [21]:
df=pd.DataFrame({
    "Name": ["Raju","Bheem","Chutki","Kalia","Indumati"],
    "Age": [9,24,17,20,30],
    "Marks": [65,90,69,85,78]
})

In [22]:
df.head(2)

    Name  Age  Marks
0   Raju    9     65
1  Bheem   24     90

In [23]:
df.tail(2)

       Name  Age  Marks
3     Kalia   20     85
4  Indumati   30     78

In [24]:
df.shape

(5, 3)

In [25]:
df.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Marks   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [27]:
df.describe().T

       count  mean        std   min   25%   50%   75%   max
Age      5.0  20.0   7.842194   9.0  17.0  20.0  24.0  30.0
Marks    5.0  77.4  10.502381  65.0  69.0  78.0  85.0  90.0

## Selecting the data

In [28]:
df["Name"]

0        Raju
1       Bheem
2      Chutki
3       Kalia
4    Indumati
Name: Name, dtype: object

In [29]:
df[["Name","Marks"]]

       Name  Marks
0      Raju     65
1     Bheem     90
2    Chutki     69
3     Kalia     85
4  Indumati     78

#### Filtering in pandas

In [30]:
df[df["Marks"]>85]

    Name  Age  Marks
1  Bheem   24     90

In [31]:
df[(df["Age"]>21)&(df["Marks"]>80)] ##multiple conditions in pandas dataframe

    Name  Age  Marks
1  Bheem   24     90

### Sortings + Value Counts

In [32]:
df.sort_values("Marks",ascending=False) ##sort the dataframe based on marks in descending order

       Name  Age  Marks
1     Bheem   24     90
3     Kalia   20     85
4  Indumati   30     78
2    Chutki   17     69
0      Raju    9     65

In [33]:
df.sort_values("Marks")

       Name  Age  Marks
0      Raju    9     65
2    Chutki   17     69
4  Indumati   30     78
3     Kalia   20     85
1     Bheem   24     90

In [34]:
df["Age"].value_counts() ##to count the number of unique values in a column

Age
9     1
24    1
17    1
20    1
30    1
Name: count, dtype: int64

### Handling Missing values

In [35]:
##Updating the dataframe with some null values
df=pd.DataFrame({
    "Name": ["Raju","Bheem","Chutki","Kalia",None,"Indumati"],
    "Age": [9,24,17,20,30,None],
    "Marks": [65,None,69,85,78,None]
})

df

       Name   Age  Marks
0      Raju   9.0   65.0
1     Bheem  24.0    NaN
2    Chutki  17.0   69.0
3     Kalia  20.0   85.0
4      None  30.0   78.0
5  Indumati   NaN    NaN

In [36]:
df.isnull() ##to check for null values in the dataframe

    Name    Age  Marks
0  False  False  False
1  False  False   True
2  False  False  False
3  False  False  False
4   True  False  False
5  False   True   True

In [37]:
df.isnull().sum() ##to count the number of null values in each column

Name     1
Age      1
Marks    2
dtype: int64

In [38]:
df.dropna()

     Name   Age  Marks
0    Raju   9.0   65.0
2  Chutki  17.0   69.0
3   Kalia  20.0   85.0

In [39]:
print(df)

       Name   Age  Marks
0      Raju   9.0   65.0
1     Bheem  24.0    NaN
2    Chutki  17.0   69.0
3     Kalia  20.0   85.0
4      None  30.0   78.0
5  Indumati   NaN    NaN

In [40]:
clean_df=df.dropna() ##to create a new dataframe without null values

In [41]:
print(clean_df)

     Name   Age  Marks
0    Raju   9.0   65.0
2  Chutki  17.0   69.0
3   Kalia  20.0   85.0

## GroupBy in pandas

In [42]:
data = {
    "Name" : ["Aman","Saurav","Karan","Subham","Abhishek",None,"Sameer"],
    "Age" : [22,23,None,22,25,24,26],
    "Marks" : [85,None,88,90,56,72,None],
    "Subject" : ["Math","Physics","Math","Chemistry","Math","Physics","Chemistry"]
}

df=pd.DataFrame(data)

print(df)

       Name   Age  Marks    Subject
0      Aman  22.0   85.0       Math
1    Saurav  23.0    NaN    Physics
2     Karan   NaN   88.0       Math
3    Subham  22.0   90.0  Chemistry
4  Abhishek  25.0   56.0       Math
5      None  24.0   72.0    Physics
6    Sameer  26.0    NaN  Chemistry

In [44]:
#basic groupby
df.groupby('Subject')['Marks'].mean()  ## Mean marks per subject

Subject
Chemistry    90.000000
Math         76.333333
Physics      72.000000
Name: Marks, dtype: float64

In [45]:
df.groupby('Subject')['Name'].count()  ## Count Students per Subject

Subject
Chemistry    2
Math         3
Physics      1
Name: Name, dtype: int64

In [46]:
df.groupby('Subject').size()

Subject
Chemistry    2
Math         3
Physics      2
dtype: int64

In [47]:
##Multiple Aggregation
df.groupby('Subject')['Marks'].agg(['mean','max','min'])

                mean   max   min
Subject
Chemistry  90.000000  90.0  90.0
Math       76.333333  88.0  56.0
Physics    72.000000  72.0  72.0

In [48]:
df.groupby('Subject')['Marks'].agg(['mean','max','min','count']) ## adding count here also

                mean   max   min  count
Subject
Chemistry  90.000000  90.0  90.0      1
Math       76.333333  88.0  56.0      3
Physics    72.000000  72.0  72.0      1

In [49]:
##Groupby by multiple columns
df.groupby(['Subject','Age'])['Marks'].mean()

Subject    Age
Chemistry  22.0    90.0
           26.0     NaN
Math       22.0    85.0
           25.0    56.0
Physics    23.0     NaN
           24.0    72.0
Name: Marks, dtype: float64